In [6]:
import pandas as pd
file_name = (r"C:\Users\user\Downloads\results.csv")
df = pd.read_csv(file_name, error_bad_lines=False)
df

b'Skipping line 156: expected 8 fields, saw 9\nSkipping line 157: expected 8 fields, saw 9\nSkipping line 158: expected 8 fields, saw 9\nSkipping line 317: expected 8 fields, saw 9\nSkipping line 318: expected 8 fields, saw 9\nSkipping line 319: expected 8 fields, saw 9\nSkipping line 1658: expected 8 fields, saw 9\nSkipping line 1659: expected 8 fields, saw 9\nSkipping line 1660: expected 8 fields, saw 9\nSkipping line 1784: expected 8 fields, saw 9\nSkipping line 1785: expected 8 fields, saw 9\nSkipping line 1786: expected 8 fields, saw 9\n'

,Gender,Event,Location,Year,Medal,Name,Nationality,Result
0,M,10000M Men,Rio,2016,G,Mohamed FARAH,USA,25:05.17
1,M,10000M Men,Rio,2016,S,Paul Kipngetich TANUI,KEN,27:05.64
2,M,10000M Men,Rio,2016,B,Tamirat TOLA,ETH,27:06.26
3,M,10000M Men,Beijing,2008,G,Kenenisa BEKELE,ETH,27:01.17
4,M,10000M Men,Beijing,2008,S,Sileshi SIHINE,ETH,27:02.77
...,...,...,...,...,...,...,...,...
2377,W,Triple Jump Women,Athens,2004,S,Hrysopiyi DEVETZI,GRE,15.25
2378,W,Triple Jump Women,Athens,2004,B,Tatyana LEBEDEVA,RUS,15.14
2379,W,Triple Jump Women,Atlanta,1996,G,Inessa KRAVETS,UKR,15.33
2380,W,Triple Jump Women,Atlanta,1996,S,Inna LASOVSKAYA,RUS,14.98
2381,W,Triple Jump Women,Atlanta,1996,B,Sarka KASPARKOVA,CZE,14.98

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.head()

,Gender,Event,Location,Year,Medal,Name,Nationality,Result
0,M,10000M Men,Rio,2016,G,Mohamed FARAH,USA,25:05.17
1,M,10000M Men,Rio,2016,S,Paul Kipngetich TANUI,KEN,27:05.64
2,M,10000M Men,Rio,2016,B,Tamirat TOLA,ETH,27:06.26
3,M,10000M Men,Beijing,2008,G,Kenenisa BEKELE,ETH,27:01.17
4,M,10000M Men,Beijing,2008,S,Sileshi SIHINE,ETH,27:02.77

In [9]:
df.tail()

,Gender,Event,Location,Year,Medal,Name,Nationality,Result
2377,W,Triple Jump Women,Athens,2004,S,Hrysopiyi DEVETZI,GRE,15.25
2378,W,Triple Jump Women,Athens,2004,B,Tatyana LEBEDEVA,RUS,15.14
2379,W,Triple Jump Women,Atlanta,1996,G,Inessa KRAVETS,UKR,15.33
2380,W,Triple Jump Women,Atlanta,1996,S,Inna LASOVSKAYA,RUS,14.98
2381,W,Triple Jump Women,Atlanta,1996,B,Sarka KASPARKOVA,CZE,14.98

In [10]:
df['Result']

0       25:05.17
1       27:05.64
2       27:06.26
3       27:01.17
4       27:02.77
          ...
2377       15.25
2378       15.14
2379       15.33
2380       14.98
2381       14.98
Name: Result, Length: 2382, dtype: object

In [11]:
df.shape

(2382, 8)

In [12]:
df.info

<bound method DataFrame.info of      Gender              Event Location  Year Medal                   Name  \
0         M         10000M Men      Rio  2016     G          Mohamed FARAH
1         M         10000M Men      Rio  2016     S  Paul Kipngetich TANUI
2         M         10000M Men      Rio  2016     B           Tamirat TOLA
3         M         10000M Men  Beijing  2008     G        Kenenisa BEKELE
4         M         10000M Men  Beijing  2008     S         Sileshi SIHINE
...     ...                ...      ...   ...   ...                    ...
2377      W  Triple Jump Women   Athens  2004     S      Hrysopiyi DEVETZI
2378      W  Triple Jump Women   Athens  2004     B       Tatyana LEBEDEVA
2379      W  Triple Jump Women  Atlanta  1996     G         Inessa KRAVETS
2380      W  Triple Jump Women  Atlanta  1996     S        Inna LASOVSKAYA
2381      W  Triple Jump Women  Atlanta  1996     B       Sarka KASPARKOVA

     Nationality    Result
0            USA  25:05.17
1            KEN  27:05.64
2            ETH  27:06.26
3            ETH  27:01.17
4            ETH  27:02.77
...          ...       ...
2377         GRE     15.25
2378         RUS     15.14
2379         UKR     15.33
2380         RUS     14.98
2381         CZE     14.98

[2382 rows x 8 columns]>

In [13]:
df.dtypes

Gender         object
Event          object
Location       object
Year            int64
Medal          object
Name           object
Nationality    object
Result         object
dtype: object

In [14]:
df.iloc[4:9]

,Gender,Event,Location,Year,Medal,Name,Nationality,Result
4,M,10000M Men,Beijing,2008,S,Sileshi SIHINE,ETH,27:02.77
5,M,10000M Men,Beijing,2008,B,Micah KOGO,KEN,27:04.11
6,M,10000M Men,Sydney,2000,G,Haile GEBRSELASSIE,ETH,27:18.20
7,M,10000M Men,Sydney,2000,S,Paul TERGAT,KEN,27:18.29
8,M,10000M Men,Sydney,2000,B,Assefa MEZGEBU,ETH,27:19.75

In [15]:
df.iloc[:, 3:4]

      Year
0     2016
1     2016
2     2016
3     2008
4     2008
...    ...
2377  2004
2378  2004
2379  1996
2380  1996
2381  1996

[2382 rows x 1 columns]

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2382 entries, 0 to 2381
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Gender       2382 non-null   object
 1   Event        2382 non-null   object
 2   Location     2382 non-null   object
 3   Year         2382 non-null   int64
 4   Medal        2382 non-null   object
 5   Name         2152 non-null   object
 6   Nationality  2382 non-null   object
 7   Result       2382 non-null   object
dtypes: int64(1), object(7)
memory usage: 149.0+ KB

In [17]:
df.index

RangeIndex(start=0, stop=2382, step=1)

In [17]:
df.iloc[3]

Gender                       M
Event               10000M Men
Location               Beijing
Year                      2008
Medal                        G
Name           Kenenisa BEKELE
Nationality                ETH
Result                27:01.17
Name: 3, dtype: object

In [18]:
df.iloc[3:6, 2:5]

  Location  Year Medal
3  Beijing  2008     G
4  Beijing  2008     S
5  Beijing  2008     B

In [19]:
df.loc [3:7, 'Nationality']

3    ETH
4    ETH
5    KEN
6    ETH
7    KEN
Name: Nationality, dtype: object

In [20]:
df.loc[df['Nationality'] == 'KEN']

,Gender,Event,Location,Year,Medal,Name,Nationality,Result
1,M,10000M Men,Rio,2016,S,Paul Kipngetich TANUI,KEN,27:05.64
5,M,10000M Men,Beijing,2008,B,Micah KOGO,KEN,27:04.11
7,M,10000M Men,Sydney,2000,S,Paul TERGAT,KEN,27:18.29
10,M,10000M Men,Barcelona,1992,S,Richard CHELIMO,KEN,27:47.72
14,M,10000M Men,Los Angeles,1984,B,Michael MUSYOKI,KEN,28:06.46
...,...,...,...,...,...,...,...,...
2283,W,Marathon Women,Rio,2016,G,Jemima Jelagat SUMGONG,KEN,2:24:04
2287,W,Marathon Women,Beijing,2008,S,Catherine NDEREBA,KEN,2h27:06
2291,W,Marathon Women,Sydney,2000,B,Joyce CHEPCHUMBA,KEN,02h24:45
2299,W,Marathon Women,London,2012,S,Priscah JEPTOO,KEN,2:23:12
2302,W,Marathon Women,Athens,2004,S,Catherine NDEREBA,KEN,2h26:32

In [21]:
df.loc[df['Nationality'] == 'KEN' , 'Medal']

1       S
5       B
7       S
10      S
14      B
       ..
2283    G
2287    S
2291    B
2299    S
2302    S
Name: Medal, Length: 87, dtype: object

In [22]:
Nation = df['Nationality']
Nation

0       USA
1       KEN
2       ETH
3       ETH
4       ETH
       ...
2377    GRE
2378    RUS
2379    UKR
2380    RUS
2381    CZE
Name: Nationality, Length: 2382, dtype: object

In [23]:
Nation[0:10]

0    USA
1    KEN
2    ETH
3    ETH
4    ETH
5    KEN
6    ETH
7    KEN
8    ETH
9    MAR
Name: Nationality, dtype: object

In [24]:
Nation.loc[Nation == 'KEN']

1       KEN
5       KEN
7       KEN
10      KEN
14      KEN
       ...
2283    KEN
2287    KEN
2291    KEN
2299    KEN
2302    KEN
Name: Nationality, Length: 87, dtype: object

In [25]:
df.iloc[10:32][['Location','Year']]

       Location  Year
10    Barcelona  1992
11    Barcelona  1992
12  Los Angeles  1984
13  Los Angeles  1984
14  Los Angeles  1984
15     Montreal  1976
16     Montreal  1976
17     Montreal  1976
18       Mexico  1968
19       Mexico  1968
20       Mexico  1968
21         Rome  1960
22         Rome  1960
23         Rome  1960
24     Helsinki  1952
25     Helsinki  1952
26     Helsinki  1952
27       Berlin  1936
28       Berlin  1936
29       Berlin  1936
30    Amsterdam  1928
31    Amsterdam  1928

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2382 entries, 0 to 2381
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Gender       2382 non-null   object
 1   Event        2382 non-null   object
 2   Location     2382 non-null   object
 3   Year         2382 non-null   int64
 4   Medal        2382 non-null   object
 5   Name         2152 non-null   object
 6   Nationality  2382 non-null   object
 7   Result       2382 non-null   object
dtypes: int64(1), object(7)
memory usage: 149.0+ KB

In [27]:
df.describe()

              Year
count  2382.000000
mean   1970.189757
std      34.695981
min    1896.000000
25%    1948.000000
50%    1976.000000
75%    2000.000000
max    2016.000000

In [28]:
df.mean()

Year    1970.189757
dtype: float64

In [30]:
df['Year'].quantile(.9)

2012.0

In [31]:
df['Gender'].unique()

array(['M', 'W'], dtype=object)

In [32]:
df['Gender'].value_counts()

M    1626
W     756
Name: Gender, dtype: int64

In [33]:
df['Year'].value_counts()

2016    141
2000    140
2012    138
2004    136
1996    130
1992    125
2008    116
1980    111
1964    102
1960     99
1984     97
1976     96
1952     93
1932     84
1972     81
1968     75
1936     66
1924     66
1948     63
1912     63
1956     58
1928     57
1908     52
1904     51
1900     45
1920     42
1896     37
1988     18
Name: Year, dtype: int64